chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/tmr/processor/tmr_p32mz1024efk144.h
PLIB_INLINE SFR_DATA _TMR_ENABLE_POS(TMR_MODULE_ID i)
{
    switch (i) {
        case TMR_ID_1 :
            return _T1CON_ON_POSITION;
        case TMR_ID_2 :
            return _T2CON_ON_POSITION;
        case TMR_ID_4 :
            return _T4CON_ON_POSITION;
        case TMR_ID_6 :
            return _T6CON_ON_POSITION;
        case TMR_ID_8 :
            return _T8CON_ON_POSITION;
        case TMR_ID_3 :
            return _T3CON_ON_POSITION;
        case TMR_ID_5 :
            return _T5CON_ON_POSITION;
        case TMR_ID_7 :
            return _T7CON_ON_POSITION;
        case TMR_ID_9 :
            return _T9CON_ON_POSITION;
        case TMR_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _TMR_STOP_IN_IDLE_POS(TMR_MODULE_ID i)
{
    switch (i) {
        case TMR_ID_1 :
            return _T1CON_SIDL_POSITION;
        case TMR_ID_2 :
            return _T2CON_SIDL_POSITION;
        case TMR_ID_4 :
            return _T4CON_SIDL_POSITION;
        case TMR_ID_6 :
            return _T6CON_SIDL_POSITION;
        case TMR_ID_8 :
            return _T8CON_SIDL_POSITION;
        case TMR_ID_3 :
            return _T3CON_SIDL_POSITION;
        case TMR_ID_5 :
            return _T5CON_SIDL_POSITION;
        case TMR_ID_7 :
            return _T7CON_SIDL_POSITION;
        case TMR_ID_9 :
            return _T9CON_SIDL_POSITION;
        case TMR_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _TMR_ASYNC_TIMER_WRITE_POS(TMR_MODULE_ID i)
{
    switch (i) {
        case TMR_ID_1 :
            return _T1CON_TWDIS_POSITION;
        case TMR_ID_2 :
            return (SFR_DATA)-1;
        case TMR_ID_4 :
            return (SFR_DATA)-1;
        case TMR_ID_6 :
            return (SFR_DATA)-1;
        case TMR_ID_8 :
            return (SFR_DATA)-1;
        case TMR_ID_3 :
            return (SFR_DATA)-1;
        case TMR_ID_5 :
            return (SFR_DATA)-1;
        case TMR_ID_7 :
            return (SFR_DATA)-1;
        case TMR_ID_9 :
            return (SFR_DATA)-1;
        case TMR_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _TMR_COUNTER_ASYNC_WRITE_IN_PROGRESS_POS(TMR_MODULE_ID i)
{
    switch (i) {
        case TMR_ID_1 :
            return _T1CON_TWIP_POSITION;
        case TMR_ID_2 :
            return (SFR_DATA)-1;
        case TMR_ID_4 :
            return (SFR_DATA)-1;
        case TMR_ID_6 :
            return (SFR_DATA)-1;
        case TMR_ID_8 :
            return (SFR_DATA)-1;
        case TMR_ID_3 :
            return (SFR_DATA)-1;
        case TMR_ID_5 :
            return (SFR_DATA)-1;
        case TMR_ID_7 :
            return (SFR_DATA)-1;
        case TMR_ID_9 :
            return (SFR_DATA)-1;
        case TMR_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _TMR_GATED_TIME_ACCUMULATION_POS(TMR_MODULE_ID i)
{
    switch (i) {
        case TMR_ID_1 :
            return _T1CON_TGATE_POSITION;
        case TMR_ID_2 :
            return _T2CON_TGATE_POSITION;
        case TMR_ID_4 :
            return _T4CON_TGATE_POSITION;
        case TMR_ID_6 :
            return _T6CON_TGATE_POSITION;
        case TMR_ID_8 :
            return _T8CON_TGATE_POSITION;
        case TMR_ID_3 :
            return _T3CON_TGATE_POSITION;
        case TMR_ID_5 :
            return _T5CON_TGATE_POSITION;
        case TMR_ID_7 :
            return _T7CON_TGATE_POSITION;
        case TMR_ID_9 :
            return _T9CON_TGATE_POSITION;
        case TMR_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _TMR_PRESCALE_POS(TMR_MODULE_ID i)
{
    switch (i) {
        case TMR_ID_1 :
            return _T1CON_TCKPS_POSITION;
        case TMR_ID_2 :
            return _T2CON_TCKPS_POSITION;
        case TMR_ID_4 :
            return _T4CON_TCKPS_POSITION;
        case TMR_ID_6 :
            return _T6CON_TCKPS_POSITION;
        case TMR_ID_8 :
            return _T8CON_TCKPS_POSITION;
        case TMR_ID_3 :
            return _T3CON_TCKPS_POSITION;
        case TMR_ID_5 :
            return _T5CON_TCKPS_POSITION;
        case TMR_ID_7 :
            return _T7CON_TCKPS_POSITION;
        case TMR_ID_9 :
            return _T9CON_TCKPS_POSITION;
        case TMR_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _TMR_CLOCK_SOURCE_SYNC_INVERTED_POS(TMR_MODULE_ID i)
{
    switch (i) {
        case TMR_ID_1 :
            return _T1CON_TSYNC_POSITION;
        case TMR_ID_2 :
            return (SFR_DATA)-1;
        case TMR_ID_4 :
            return (SFR_DATA)-1;
        case TMR_ID_6 :
            return (SFR_DATA)-1;
        case TMR_ID_8 :
            return (SFR_DATA)-1;
        case TMR_ID_3 :
            return (SFR_DATA)-1;
        case TMR_ID_5 :
            return (SFR_DATA)-1;
        case TMR_ID_7 :
            return (SFR_DATA)-1;
        case TMR_ID_9 :
            return (SFR_DATA)-1;
        case TMR_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _TMR_CLOCK_SOURCE_POS(TMR_MODULE_ID i)
{
    switch (i) {
        case TMR_ID_1 :
            return _T1CON_TCS_POSITION;
        case TMR_ID_2 :
            return _T2CON_TCS_POSITION;
        case TMR_ID_4 :
            return _T4CON_TCS_POSITION;
        case TMR_ID_6 :
            return _T6CON_TCS_POSITION;
        case TMR_ID_8 :
            return _T8CON_TCS_POSITION;
        case TMR_ID_3 :
            return _T3CON_TCS_POSITION;
        case TMR_ID_5 :
            return _T5CON_TCS_POSITION;
        case TMR_ID_7 :
            return _T7CON_TCS_POSITION;
        case TMR_ID_9 :
            return _T9CON_TCS_POSITION;
        case TMR_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

